In [1]:
%load_ext autoreload
%autoreload 2
import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd
import processing_netcdf as pcdf
import geopandas as gpd
from geopandas import GeoDataFrame
import shapely.geometry 
import numpy as np
from shapely import geometry as gmty
from geofeather import to_geofeather, from_geofeather

In [2]:
import glob
import os

In [3]:
#path for 11 models
path = "/home/mlopez/EXEC/tmin_annual_45/"

In [4]:
files = list(glob.glob(os.path.join(path,'*.*')))

In [5]:
files

['/home/mlopez/EXEC/tmin_annual_45/BNU-ESM_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/INM-CM4_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/CMCC-CMS_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/IPSL-CM5A-LR_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/IPSL-CM5B-LR_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/NorESM1-M_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/CanESM2_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/GFDL-ESM2M_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/HadGEM2-CC_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/MPI-ESM-LR_rcp45_tn_mean_annual.nc',
 '/home/mlopez/EXEC/tmin_annual_45/ACCESS1-3_rcp45_tn_mean_annual.nc']

# Create DF of all models

In [6]:
dflist = []

In [8]:
for file in files:
    df = pcdf.load_as_df(file)
    dflist.append(df)

/exec/mlopez/Code/GitHub/processing_netcdf.py:24: RuntimeWarning: Converting a CFTimeIndex with dates from a non-standard calendar, 'noleap', to a pandas.DatetimeIndex, which uses dates from the standard calendar.  This may lead to subtle errors in operations that depend on the length of time between dates.
  ds['time'] = index.to_datetimeindex()
/exec/mlopez/Code/GitHub/processing_netcdf.py:24: RuntimeWarning: Converting a CFTimeIndex with dates from a non-standard calendar, 'noleap', to a pandas.DatetimeIndex, which uses dates from the standard calendar.  This may lead to subtle errors in operations that depend on the length of time between dates.
  ds['time'] = index.to_datetimeindex()
/exec/mlopez/Code/GitHub/processing_netcdf.py:24: RuntimeWarning: Converting a CFTimeIndex with dates from a non-standard calendar, '360_day', to a pandas.DatetimeIndex, which uses dates from the standard calendar.  This may lead to subtle errors in operations that depend on the length of time between dates.
  ds['time'] = index.to_datetimeindex()

In [9]:
dflist

[                                    tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  254.500427
                      1951-01-01  253.544449
                      1952-01-01  255.910553
                      1953-01-01  255.576248
                      1954-01-01  254.405655
 ...                                     ...
 40.041039 -74.045807 2096-01-01  281.649323
                      2097-01-01  283.469208
                      2098-01-01  282.880341
                      2099-01-01  283.279266
                      2100-01-01  282.537384

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  255.074188
                      1951-01-01  254.698029
                      1952-01-01  255.673157
                      1953-01-01  255.497559
                      1954-01-01  256.564209
 ...                                     ...
 40.041039 -74.045807 2096-01-01  281.227112
                      2097-01-01  281.039825
                      2098-01-01  280.721497
                      2099-01-01  281.101929
                      2100-01-01  280.730682

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  254.187164
                      1951-01-01  256.215454
                      1952-01-01  255.155716
                      1953-01-01  255.078720
                      1954-01-01  255.425613
 ...                                     ...
 40.041039 -74.045807 2096-01-01  284.232117
                      2097-01-01  282.211548
                      2098-01-01  282.108063
                      2099-01-01  281.998016
                      2100-01-01  282.798798

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  256.442200
                      1951-01-01  255.498688
                      1952-01-01  253.876801
                      1953-01-01  256.490570
                      1954-01-01  255.453552
 ...                                     ...
 40.041039 -74.045807 2096-01-01  282.623016
                      2097-01-01  283.224487
                      2098-01-01  281.648956
                      2099-01-01  284.658783
                      2100-01-01  281.387543

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  256.909210
                      1951-01-01  255.303421
                      1952-01-01  256.424377
                      1953-01-01  255.709305
                      1954-01-01  256.601440
 ...                                     ...
 40.041039 -74.045807 2096-01-01  282.337189
                      2097-01-01  282.276978
                      2098-01-01  281.972992
                      2099-01-01  282.374786
                      2100-01-01  282.844513

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  257.204071
                      1951-01-01  255.538437
                      1952-01-01  255.467987
                      1953-01-01  254.634674
                      1954-01-01  255.788116
 ...                                     ...
 40.041039 -74.045807 2096-01-01  282.007874
                      2097-01-01  281.860657
                      2098-01-01  281.271240
                      2099-01-01  282.671326
                      2100-01-01  281.702484

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  253.572266
                      1951-01-01  254.915131
                      1952-01-01  254.914276
                      1953-01-01  254.480957
                      1954-01-01  255.685318
 ...                                     ...
 40.041039 -74.045807 2096-01-01  282.509399
                      2097-01-01  283.073639
                      2098-01-01  282.526398
                      2099-01-01  281.982117
                      2100-01-01  282.311737

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  255.587387
                      1951-01-01  254.586319
                      1952-01-01  254.877808
                      1953-01-01  255.619492
                      1954-01-01  256.057953
 ...                                     ...
 40.041039 -74.045807 2096-01-01  281.726135
                      2097-01-01  280.896149
                      2098-01-01  280.709717
                      2099-01-01  280.765839
                      2100-01-01  280.242859

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  253.712845
                      1951-01-01  254.432144
                      1952-01-01  253.762115
                      1953-01-01  254.860352
                      1954-01-01  255.294189
 ...                                     ...
 40.041039 -74.045807 2096-01-01  283.614624
                      2097-01-01  281.809509
                      2098-01-01  283.126526
                      2099-01-01  284.432190
                      2100-01-01  283.735535

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  255.212845
                      1951-01-01  253.744156
                      1952-01-01  253.247330
                      1953-01-01  253.125092
                      1954-01-01  255.486984
 ...                                     ...
 40.041039 -74.045807 2096-01-01  281.780731
                      2097-01-01  282.407318
                      2098-01-01  280.090912
                      2099-01-01  281.967072
                      2100-01-01  282.433807

 [11507106 rows x 1 columns],                                     tn_mean
 lat       lon        time
 66.623306 -89.045212 1950-01-01  255.607208
                      1951-01-01  255.747223
                      1952-01-01  255.518768
                      1953-01-01  255.136093
                      1954-01-01  256.485352
 ...                                     ...
 40.041039 -74.045807 2096-01-01  281.487885
                      2097-01-01  281.799835
                      2098-01-01  283.148804
                      2099-01-01  282.153473
                      2100-01-01  281.282928

 [11507106 rows x 1 columns]]

In [10]:
#Takes 3 min
%time df11 = pd.concat(dflist)

CPU times: user 3min 32s, sys: 8min 14s, total: 11min 46s
Wall time: 1min 26s

In [11]:
df11

                                    tn_mean
lat       lon        time
66.623306 -89.045212 1950-01-01  254.500427
                     1951-01-01  253.544449
                     1952-01-01  255.910553
                     1953-01-01  255.576248
                     1954-01-01  254.405655
...                                     ...
40.041039 -74.045807 2096-01-01  281.487885
                     2097-01-01  281.799835
                     2098-01-01  283.148804
                     2099-01-01  282.153473
                     2100-01-01  281.282928

[126578166 rows x 1 columns]

In [12]:
dftgm = df11.reset_index()

In [13]:
dftgm

                 lat        lon       time     tn_mean
0          66.623306 -89.045212 1950-01-01  254.500427
1          66.623306 -89.045212 1951-01-01  253.544449
2          66.623306 -89.045212 1952-01-01  255.910553
3          66.623306 -89.045212 1953-01-01  255.576248
4          66.623306 -89.045212 1954-01-01  254.405655
...              ...        ...        ...         ...
126578161  40.041039 -74.045807 2096-01-01  281.487885
126578162  40.041039 -74.045807 2097-01-01  281.799835
126578163  40.041039 -74.045807 2098-01-01  283.148804
126578164  40.041039 -74.045807 2099-01-01  282.153473
126578165  40.041039 -74.045807 2100-01-01  281.282928

[126578166 rows x 4 columns]

# Get the mean for 11 models

In [14]:
#Takes 48s
%time dftgm2 = dftgm.groupby(["lat", "lon", "time"]).mean()

CPU times: user 1min 7s, sys: 4min 44s, total: 5min 51s
Wall time: 1min 26s

In [15]:
dftgm2

                                    tn_mean
lat       lon        time
40.041039 -89.045212 1950-01-01  278.676361
                     1951-01-01  278.482910
                     1952-01-01  278.417999
                     1953-01-01  278.149658
                     1954-01-01  278.387756
...                                     ...
66.623306 -61.296322 2096-01-01  263.821442
                     2097-01-01  263.411469
                     2098-01-01  264.344482
                     2099-01-01  263.893616
                     2100-01-01  263.777435

[11507106 rows x 1 columns]

# Transform temp to Celsius

In [16]:
dfC = dftgm2.copy()
dfC["tn_mean"] = dfC["tn_mean"] -273.15

# Define 3 periods of time:

In [17]:
year_groups = {y:0 for y in range(1980,2011)}
year_groups.update({y:1 for y in range(2041,2071)})
year_groups.update({y:2 for y in range(2071,2101)})
#Get the mean of every period
dfC2 = dfC.reset_index()
dfp = dfC2.groupby([dfC2.time.dt.year.map(year_groups), "lat","lon"]).mean()

In [18]:
dfp.reset_index()

        time        lat        lon    tn_mean
0        0.0  40.041039 -89.045212   5.699457
1        0.0  40.041039 -88.961884   5.672854
2        0.0  40.041039 -88.878548   5.668031
3        0.0  40.041039 -88.795219   5.707927
4        0.0  40.041039 -88.711891   5.721406
...      ...        ...        ...        ...
228613   2.0  66.623306 -61.629639  -9.844964
228614   2.0  66.623306 -61.546310 -10.091969
228615   2.0  66.623306 -61.462978  -9.930800
228616   2.0  66.623306 -61.379650  -9.874316
228617   2.0  66.623306 -61.296322  -9.383389

[228618 rows x 4 columns]

# Historic Period

485,881/3 = 161,960. ---- instead 333,469 rows × 4 columns

In [19]:
df_h = dfp.query("time==0.0")
df_h.reset_index()

       time        lat        lon    tn_mean
0       0.0  40.041039 -89.045212   5.699457
1       0.0  40.041039 -88.961884   5.672854
2       0.0  40.041039 -88.878548   5.668031
3       0.0  40.041039 -88.795219   5.707927
4       0.0  40.041039 -88.711891   5.721406
...     ...        ...        ...        ...
76201   0.0  66.623306 -61.629639 -13.102902
76202   0.0  66.623306 -61.546310 -13.329987
76203   0.0  66.623306 -61.462978 -13.160083
76204   0.0  66.623306 -61.379650 -13.090538
76205   0.0  66.623306 -61.296322 -12.591096

[76206 rows x 4 columns]

In [ ]:
df2050 = dfp.query("time==1.0")
df2050.reset_index()

In [ ]:
df2080 = dfp.query("time==2.0")
df2080.reset_index()

## Import dataframe with polygons

In [ ]:
dfpolyshape = from_geofeather('Grid-TerritoiresGuides.feather')

In [ ]:
dfpolyshape

## Merge data with mask

In [ ]:
dftg11TG = pd.merge(df_h, dfpolyshape, on=["lat","lon"])

In [ ]:
dftg11TG

In [ ]:
dftg11TG.TER_GUIDE.value_counts()

In [ ]:
TG4a = dftg11TG[dftg11TG.TER_GUIDE == "4a"]
TG4a

In [ ]:
TG4a.to_csv("/home/mlopez/EXEC/Tg_csv/TG4a11.csv")

# ---- Create GeoJson file ----

In [ ]:
geometry = dftg11TG["geometry"]

In [ ]:
crs = {'init': "epsg:4326"}
gdf = GeoDataFrame(dftg11TG, crs=crs, geometry=geometry)

In [ ]:
gdf.to_file("TG11tg.json", driver="GeoJSON")